origin_redis/redis/bench-results/ext/fs_redis_fdp_disabled_everysec/lastlast/summary_2.txt
====== SET ======
  23592960 requests completed in 580.27 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.143 milliseconds (cumulative count 1)
50.000% <= 0.719 milliseconds (cumulative count 12055934)
75.000% <= 0.895 milliseconds (cumulative count 17833489)
87.500% <= 1.031 milliseconds (cumulative count 20688424)
93.750% <= 1.167 milliseconds (cumulative count 22124691)
96.875% <= 1.303 milliseconds (cumulative count 22884553)
98.438% <= 1.439 milliseconds (cumulative count 23236306)
99.219% <= 1.607 milliseconds (cumulative count 23411584)
99.609% <= 2.151 milliseconds (cumulative count 23500821)
99.805% <= 12.935 milliseconds (cumulative count 23546884)
99.902% <= 22.783 milliseconds (cumulative count 23569936)
99.951% <= 36.767 milliseconds (cumulative count 23581441)
99.976% <= 50.655 milliseconds (cumulative count 23587200)
99.988% <= 283.135 milliseconds (cumulative count 23590081)
99.994% <= 1463.295 milliseconds (cumulative count 23591536)
99.997% <= 3387.391 milliseconds (cumulative count 23592260)
99.998% <= 5365.759 milliseconds (cumulative count 23592610)
99.999% <= 7561.215 milliseconds (cumulative count 23592810)
100.000% <= 9584.639 milliseconds (cumulative count 23592910)
100.000% <= 10002.431 milliseconds (cumulative count 23592960)
100.000% <= 10002.431 milliseconds (cumulative count 23592960)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.002% <= 0.207 milliseconds (cumulative count 520)
0.337% <= 0.303 milliseconds (cumulative count 79496)
4.441% <= 0.407 milliseconds (cumulative count 1047782)
14.664% <= 0.503 milliseconds (cumulative count 3459630)
28.172% <= 0.607 milliseconds (cumulative count 6646638)
48.091% <= 0.703 milliseconds (cumulative count 11346089)
65.038% <= 0.807 milliseconds (cumulative count 15344440)
76.446% <= 0.903 milliseconds (cumulative count 18035974)
86.089% <= 1.007 milliseconds (cumulative count 20310988)
91.348% <= 1.103 milliseconds (cumulative count 21551596)
94.951% <= 1.207 milliseconds (cumulative count 22401726)
96.997% <= 1.303 milliseconds (cumulative count 22884553)
98.237% <= 1.407 milliseconds (cumulative count 23177120)
98.873% <= 1.503 milliseconds (cumulative count 23327076)
99.231% <= 1.607 milliseconds (cumulative count 23411584)
99.398% <= 1.703 milliseconds (cumulative count 23450819)
99.494% <= 1.807 milliseconds (cumulative count 23473535)
99.545% <= 1.903 milliseconds (cumulative count 23485572)
99.579% <= 2.007 milliseconds (cumulative count 23493652)
99.601% <= 2.103 milliseconds (cumulative count 23498869)
99.685% <= 3.103 milliseconds (cumulative count 23518708)
99.711% <= 4.103 milliseconds (cumulative count 23524787)
99.743% <= 5.103 milliseconds (cumulative count 23532293)
99.752% <= 6.103 milliseconds (cumulative count 23534348)
99.752% <= 7.103 milliseconds (cumulative count 23534488)
99.753% <= 8.103 milliseconds (cumulative count 23534610)
99.757% <= 9.103 milliseconds (cumulative count 23535694)
99.769% <= 10.103 milliseconds (cumulative count 23538498)
99.781% <= 11.103 milliseconds (cumulative count 23541223)
99.791% <= 12.103 milliseconds (cumulative count 23543570)
99.807% <= 13.103 milliseconds (cumulative count 23547435)
99.820% <= 14.103 milliseconds (cumulative count 23550504)
99.834% <= 15.103 milliseconds (cumulative count 23553726)
99.842% <= 16.103 milliseconds (cumulative count 23555762)
99.852% <= 17.103 milliseconds (cumulative count 23558015)
99.857% <= 18.111 milliseconds (cumulative count 23559262)
99.868% <= 19.103 milliseconds (cumulative count 23561827)
99.881% <= 20.111 milliseconds (cumulative count 23564843)
99.887% <= 21.103 milliseconds (cumulative count 23566410)
99.896% <= 22.111 milliseconds (cumulative count 23568321)
99.906% <= 23.103 milliseconds (cumulative count 23570894)
99.916% <= 24.111 milliseconds (cumulative count 23573192)
99.921% <= 25.103 milliseconds (cumulative count 23574234)
99.924% <= 26.111 milliseconds (cumulative count 23575137)
99.931% <= 27.103 milliseconds (cumulative count 23576656)
99.937% <= 28.111 milliseconds (cumulative count 23578086)
99.940% <= 29.103 milliseconds (cumulative count 23578884)
99.943% <= 30.111 milliseconds (cumulative count 23579433)
99.944% <= 31.103 milliseconds (cumulative count 23579800)
99.945% <= 32.111 milliseconds (cumulative count 23580018)
99.947% <= 33.119 milliseconds (cumulative count 23580348)
99.948% <= 34.111 milliseconds (cumulative count 23580777)
99.949% <= 35.103 milliseconds (cumulative count 23580970)
99.950% <= 36.127 milliseconds (cumulative count 23581214)
99.952% <= 37.119 milliseconds (cumulative count 23581609)
99.953% <= 38.111 milliseconds (cumulative count 23581972)
99.955% <= 39.103 milliseconds (cumulative count 23582318)
99.956% <= 40.127 milliseconds (cumulative count 23582679)
99.959% <= 41.119 milliseconds (cumulative count 23583259)
99.961% <= 42.111 milliseconds (cumulative count 23583650)
99.962% <= 43.103 milliseconds (cumulative count 23584036)
99.964% <= 44.127 milliseconds (cumulative count 23584356)
99.965% <= 45.119 milliseconds (cumulative count 23584687)
99.968% <= 46.111 milliseconds (cumulative count 23585350)
99.969% <= 47.103 milliseconds (cumulative count 23585696)
99.972% <= 48.127 milliseconds (cumulative count 23586329)
99.974% <= 49.119 milliseconds (cumulative count 23586717)
99.975% <= 50.111 milliseconds (cumulative count 23587007)
99.976% <= 51.103 milliseconds (cumulative count 23587276)
99.977% <= 52.127 milliseconds (cumulative count 23587555)
99.978% <= 53.119 milliseconds (cumulative count 23587734)
99.978% <= 54.111 milliseconds (cumulative count 23587842)
99.979% <= 55.103 milliseconds (cumulative count 23588114)
99.980% <= 56.127 milliseconds (cumulative count 23588316)
99.982% <= 57.119 milliseconds (cumulative count 23588624)
99.982% <= 58.111 milliseconds (cumulative count 23588754)
99.982% <= 59.103 milliseconds (cumulative count 23588785)
99.983% <= 60.127 milliseconds (cumulative count 23588880)
99.983% <= 61.119 milliseconds (cumulative count 23588935)
99.983% <= 62.111 milliseconds (cumulative count 23588970)
99.983% <= 63.103 milliseconds (cumulative count 23589035)
99.984% <= 64.127 milliseconds (cumulative count 23589282)
99.985% <= 65.119 milliseconds (cumulative count 23589310)
99.985% <= 66.111 milliseconds (cumulative count 23589378)
99.985% <= 67.135 milliseconds (cumulative count 23589410)
99.985% <= 68.159 milliseconds (cumulative count 23589460)
99.985% <= 73.151 milliseconds (cumulative count 23589492)
99.986% <= 74.111 milliseconds (cumulative count 23589561)
99.986% <= 75.135 milliseconds (cumulative count 23589610)
99.986% <= 77.119 milliseconds (cumulative count 23589627)
99.986% <= 78.143 milliseconds (cumulative count 23589660)
99.986% <= 86.143 milliseconds (cumulative count 23589696)
99.986% <= 87.103 milliseconds (cumulative count 23589710)
99.986% <= 88.127 milliseconds (cumulative count 23589752)
99.986% <= 89.151 milliseconds (cumulative count 23589760)
99.987% <= 96.127 milliseconds (cumulative count 23589789)
99.987% <= 97.151 milliseconds (cumulative count 23589810)
99.987% <= 181.119 milliseconds (cumulative count 23589826)
99.987% <= 182.143 milliseconds (cumulative count 23589839)
99.987% <= 183.167 milliseconds (cumulative count 23589860)
99.987% <= 185.215 milliseconds (cumulative count 23589890)
99.987% <= 186.111 milliseconds (cumulative count 23589910)
99.987% <= 198.143 milliseconds (cumulative count 23589942)
99.987% <= 199.167 milliseconds (cumulative count 23589960)
99.987% <= 217.215 milliseconds (cumulative count 23589990)
99.987% <= 218.111 milliseconds (cumulative count 23590010)
99.988% <= 240.127 milliseconds (cumulative count 23590040)
99.988% <= 241.151 milliseconds (cumulative count 23590060)
99.988% <= 283.135 milliseconds (cumulative count 23590081)
99.988% <= 284.159 milliseconds (cumulative count 23590107)
99.988% <= 285.183 milliseconds (cumulative count 23590110)
99.988% <= 329.215 milliseconds (cumulative count 23590117)
99.988% <= 330.239 milliseconds (cumulative count 23590138)
99.988% <= 331.263 milliseconds (cumulative count 23590150)
99.988% <= 332.287 milliseconds (cumulative count 23590160)
99.988% <= 347.135 milliseconds (cumulative count 23590181)
99.988% <= 348.159 milliseconds (cumulative count 23590202)
99.988% <= 349.183 milliseconds (cumulative count 23590210)
99.988% <= 356.351 milliseconds (cumulative count 23590231)
99.988% <= 357.119 milliseconds (cumulative count 23590241)
99.989% <= 358.143 milliseconds (cumulative count 23590260)
99.989% <= 368.127 milliseconds (cumulative count 23590283)
99.989% <= 369.151 milliseconds (cumulative count 23590307)
99.989% <= 370.175 milliseconds (cumulative count 23590310)
99.989% <= 376.319 milliseconds (cumulative count 23590344)
99.989% <= 377.343 milliseconds (cumulative count 23590360)
99.989% <= 383.231 milliseconds (cumulative count 23590380)
99.989% <= 384.255 milliseconds (cumulative count 23590410)
99.989% <= 387.327 milliseconds (cumulative count 23590427)
99.989% <= 388.351 milliseconds (cumulative count 23590457)
99.989% <= 389.119 milliseconds (cumulative count 23590460)
99.989% <= 397.311 milliseconds (cumulative count 23590471)
99.990% <= 398.335 milliseconds (cumulative count 23590495)
99.990% <= 399.103 milliseconds (cumulative count 23590510)
99.990% <= 402.175 milliseconds (cumulative count 23590569)
99.990% <= 403.199 milliseconds (cumulative count 23590610)
99.990% <= 424.191 milliseconds (cumulative count 23590638)
99.990% <= 425.215 milliseconds (cumulative count 23590660)
99.990% <= 433.151 milliseconds (cumulative count 23590696)
99.990% <= 434.175 milliseconds (cumulative count 23590710)
99.991% <= 449.279 milliseconds (cumulative count 23590731)
99.991% <= 450.303 milliseconds (cumulative count 23590758)
99.991% <= 451.327 milliseconds (cumulative count 23590760)
99.991% <= 454.143 milliseconds (cumulative count 23590778)
99.991% <= 455.167 milliseconds (cumulative count 23590807)
99.991% <= 456.191 milliseconds (cumulative count 23590810)
99.991% <= 475.135 milliseconds (cumulative count 23590836)
99.991% <= 476.159 milliseconds (cumulative count 23590860)
99.991% <= 483.327 milliseconds (cumulative count 23590867)
99.991% <= 484.351 milliseconds (cumulative count 23590906)
99.991% <= 485.119 milliseconds (cumulative count 23590938)
99.992% <= 486.143 milliseconds (cumulative count 23590960)
99.992% <= 680.447 milliseconds (cumulative count 23590985)
99.992% <= 681.471 milliseconds (cumulative count 23591010)
99.992% <= 739.327 milliseconds (cumulative count 23591036)
99.992% <= 740.351 milliseconds (cumulative count 23591060)
99.992% <= 797.183 milliseconds (cumulative count 23591064)
99.992% <= 798.207 milliseconds (cumulative count 23591102)
99.992% <= 799.231 milliseconds (cumulative count 23591110)
99.992% <= 895.487 milliseconds (cumulative count 23591111)
99.992% <= 896.511 milliseconds (cumulative count 23591154)
99.992% <= 897.535 milliseconds (cumulative count 23591160)
99.993% <= 930.303 milliseconds (cumulative count 23591195)
99.993% <= 931.327 milliseconds (cumulative count 23591210)
99.993% <= 1082.367 milliseconds (cumulative count 23591220)
99.993% <= 1083.391 milliseconds (cumulative count 23591258)
99.993% <= 1084.415 milliseconds (cumulative count 23591260)
99.993% <= 1145.855 milliseconds (cumulative count 23591262)
99.993% <= 1146.879 milliseconds (cumulative count 23591298)
99.993% <= 1147.903 milliseconds (cumulative count 23591310)
99.993% <= 1170.431 milliseconds (cumulative count 23591313)
99.993% <= 1171.455 milliseconds (cumulative count 23591358)
99.993% <= 1172.479 milliseconds (cumulative count 23591360)
99.993% <= 1184.767 milliseconds (cumulative count 23591389)
99.993% <= 1185.791 milliseconds (cumulative count 23591410)
99.994% <= 1281.023 milliseconds (cumulative count 23591436)
99.994% <= 1282.047 milliseconds (cumulative count 23591460)
99.994% <= 1350.655 milliseconds (cumulative count 23591489)
99.994% <= 1351.679 milliseconds (cumulative count 23591506)
99.994% <= 1352.703 milliseconds (cumulative count 23591510)
99.994% <= 1463.295 milliseconds (cumulative count 23591536)
99.994% <= 1464.319 milliseconds (cumulative count 23591560)
99.994% <= 1495.039 milliseconds (cumulative count 23591566)
99.994% <= 1496.063 milliseconds (cumulative count 23591610)
99.994% <= 1534.975 milliseconds (cumulative count 23591640)
99.994% <= 1535.999 milliseconds (cumulative count 23591660)
99.995% <= 1721.343 milliseconds (cumulative count 23591673)
99.995% <= 1722.367 milliseconds (cumulative count 23591710)
99.995% <= 2066.431 milliseconds (cumulative count 23591750)
99.995% <= 2067.455 milliseconds (cumulative count 23591760)
99.995% <= 2293.759 milliseconds (cumulative count 23591786)
99.995% <= 2295.807 milliseconds (cumulative count 23591810)
99.995% <= 2326.527 milliseconds (cumulative count 23591839)
99.995% <= 2328.575 milliseconds (cumulative count 23591860)
99.996% <= 2387.967 milliseconds (cumulative count 23591910)
99.996% <= 2533.375 milliseconds (cumulative count 23591940)
99.996% <= 2535.423 milliseconds (cumulative count 23591960)
99.996% <= 2625.535 milliseconds (cumulative count 23592010)
99.996% <= 2693.119 milliseconds (cumulative count 23592060)
99.996% <= 2897.919 milliseconds (cumulative count 23592089)
99.996% <= 2899.967 milliseconds (cumulative count 23592110)
99.996% <= 2918.399 milliseconds (cumulative count 23592122)
99.997% <= 2920.447 milliseconds (cumulative count 23592160)
99.997% <= 3266.559 milliseconds (cumulative count 23592210)
99.997% <= 3387.391 milliseconds (cumulative count 23592260)
99.997% <= 3590.143 milliseconds (cumulative count 23592286)
99.997% <= 3592.191 milliseconds (cumulative count 23592310)
99.997% <= 4106.239 milliseconds (cumulative count 23592360)
99.998% <= 4546.559 milliseconds (cumulative count 23592410)
99.998% <= 4763.647 milliseconds (cumulative count 23592460)
99.998% <= 4915.199 milliseconds (cumulative count 23592510)
99.998% <= 5238.783 milliseconds (cumulative count 23592560)
99.998% <= 5361.663 milliseconds (cumulative count 23592585)
99.999% <= 5365.759 milliseconds (cumulative count 23592610)
99.999% <= 6135.807 milliseconds (cumulative count 23592630)
99.999% <= 6139.903 milliseconds (cumulative count 23592660)
99.999% <= 6361.087 milliseconds (cumulative count 23592710)
99.999% <= 7544.831 milliseconds (cumulative count 23592738)
99.999% <= 7548.927 milliseconds (cumulative count 23592760)
99.999% <= 7561.215 milliseconds (cumulative count 23592810)
100.000% <= 7954.431 milliseconds (cumulative count 23592860)
100.000% <= 9576.447 milliseconds (cumulative count 23592862)
100.000% <= 9584.639 milliseconds (cumulative count 23592910)
100.000% <= 10002.431 milliseconds (cumulative count 23592960)
100.000% <= 10002.431 milliseconds (cumulative count 23592960)
100.000% <= 10002.431 milliseconds (cumulative count 23592960)
[...]

Summary:
  throughput summary: 40658.59 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        1.108     0.136     0.719     1.215     1.535 10002.431